part_03/01_hydrofoil/foil_gmsh_mesh/transient/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

// *** Air @ 20C ***
//rho             [1 -3  0 0 0 0 0] 1.2;     // density [kg/m^3]
//nu              [0  2 -1 0 0 0 0] 1.5e-05; // kinematic viscosity [m^2/s]

// *** Water @ 02C***
rho             [1 -3  0 0 0 0 0] 1000;  // density [kg/m^3]
nu              [0  2 -1 0 0 0 0] 1e-06; // kinematic viscosity [m^2/s]

// ************************************************************************* //
